	[{"number":1,"name":"Teriyaki Madness","youtubeLink":"https://www.youtube.com/watch?v=1wMUzUys6Rk","coords":"47.618894062816224, -122.3128803551932","googleMapsLink":"https://maps.app.goo.gl/jfDmwF9gamsbA8379","summary":"The chicken is very juicy, cooked whole and sliced just before serving.\r\nThe teriyaki sauce is not too gloppy, not too sweet, and has a shiny glazy look.\r\nThe salad uses a Roma mix and comes with a sweet mayonnaise dressing with black pepper.\r\nThe gyoza are deep fried, implying a standard but satisfactory preparation."},{"number":2,"name":"Bro's Teriyaki","youtubeLink":"https://www.youtube.com/watch?v=sYFYzeBHjsc","coords":"47.66887826655351, -122.38822589246739","googleMapsLink":"https://maps.app.goo.gl/wX1RtbXdzUgxkVMm7","summary":"The chicken is plentiful and smoky, with a visible smoke ring indicating moderate juiciness, not dry.\r\nThe teriyaki sauce is very gloppy, tasting slightly raw like soy sauce thickened with cornstarch, without much flavor concentration.\r\nThe salad features a Russian dressing with pickles, offering a different twist from the usual sweet mayo dressing.\r\nThe gyoza are very crispy, though the flavor is described as nothing spectacular, emphasizing texture over taste."},{"number":3,"name":"Nikko Teriyaki","youtubeLink":"https://www.youtube.com/watch?v=ysEZuCXF_04","coords":"47.56079063250395, -122.38496049885572","googleMapsLink":"https://maps.app.goo.gl/FsH7NKmofVjFHH4F9","summary":"The chicken is marinated, giving it a juicy, almost ham-like texture with a nice char, and the sauce is sweet but not overwhelming, creating a nice glaze.\r\nThe salad dressing is noted for its sweet, mayonnaise-like quality with an added sesame oil aroma, enhancing its flavor.\r\nThe gyoza have better flavor than most, with a noticeable amount of vegetables and white pepper, though not as crispy as some.\r\nThe rice is proper Japanese style short grain, slightly mushy but acceptable, underscoring the overall quality of the meal."},{"number":4,"name":"Toshi's Teriyaki","youtubeLink":"https://www.youtube.com/watch?v=R-frrl0pFgw","coords":"47.57344005567681, -122.16840632438192","googleMapsLink":"https://maps.app.goo.gl/e1kGypU9z3849AJaA","summary":"Chicken is pale with minimal grill marks, indicating a lack of smokiness, and the sauce seems to have been added late, leading to superficial flavoring.\r\nThe salad consists of basic iceberg lettuce with a very sweet, syrupy dressing, lacking in complexity and depth.\r\nGyoza offer a generous portion but suffer from an odd texture and a meager amount of filling, indicating a potential compromise on quality.\r\nThe rice is Chinese style, medium grain, with some grains overly dry and crunchy, suggesting it may have been overcooked or left in the cooker too long."},{"number":5,"name":"Rainier Teriyaki","youtubeLink":"https://www.youtube.com/watch?v=Wbtish4P98s","coords":"47.57330021841308, -122.29370002016685","googleMapsLink":"https://maps.app.goo.gl/wDyzUU5d9pSDcdpH7","summary":"Chicken is juicy with a significant char and crunchy exterior, marinated for enhanced flavor.\r\nTeriyaki sauce is well-balanced, not too gloppy, complementing the chicken without overpowering.\r\nSalad dressing is a cut above, with a vinegary sweetness and a sesame oil aroma, elevating the standard iceberg mix.\r\nGyoza are crispy with a filling better than most, though the skins are slightly plasticky, slightly detracting from the overall quality."},{"number":6,"name":"O-Maki North Capitol Hill","youtubeLink":"https://www.youtube.com/watch?v=zYY0b8n0COc","coords":"47.641156728342196, -122.32033294771875","googleMapsLink":"https://maps.app.goo.gl/rdJYX2yepQ8QvzBW7","summary":"The dumplings, priced at $8 and semi pan-fried, are likely factory-made due to the uniform lines on their bottoms. They're just fine in taste but not exceptional, especially given the price.\r\nInstead of a traditional salad, a mix of vegetables including broccoli, cauliflower, cherry tomatoes, and onions is served, offering a nice change with a tangy, slightly creamy dressing that's appreciated.\r\nThe teriyaki sauce on the chicken is not too thick and has plenty of flavor, suggesting a well-balanced recipe.\r\nThe chicken itself is potentially over-marinated, giving it an almost hammy taste, indicating a very deep absorption of the marinade, with some texture and char."},{"number":7,"name":"Palmi","youtubeLink":"https://www.youtube.com/watch?v=WrZ14kzuyK8","coords":"47.65036589075394, -122.34963545416086","googleMapsLink":"https://maps.app.goo.gl/xWRKm9D4ZEeFuUhM7","summary":"The rice is mushy, lacking desired texture, indicating overcooking.\r\nDumplings are ambiguously cooked, not clearly deep or pan-fried, and while factory-made, the sauce is notably different, rich in white pepper and vinegar, likened to hot and sour soup.\r\nSalad dressing is creamy and tangy, less sweet than typical, enhancing the salad despite some brown, wilted lettuce.\r\nChicken is very pale, showing signs of marination with a smoked texture but lacking sufficient teriyaki sauce, crucially improved by requesting extra sauce, which is less sweet, more winey, and not too thick."},{"number":8,"name":"Okinawa Teriyaki","youtubeLink":"https://www.youtube.com/watch?v=ozGdp8a-mLM","coords":"47.605097724009276, -122.33800221534447","googleMapsLink":"https://maps.app.goo.gl/7ZuG2NvHmGrMT3ov9","summary":"The salad, served in a generous portion with Roma lettuce instead of Iceberg, comes with a light dressing that's not very sweet, almost like a thin mayonnaise.\r\nDumplings are deep-fried, evoking a taste memory akin to childhood lunches packed with vinegary soy sauce-soaked dumplings.\r\nThe rice, slightly mushy, offers a contrast with nicely separated upper grains, although the bottom layer becomes a bit mushy.\r\nChicken showcases a dark char, favoring charring over juiciness, with a trade-off that leans towards less sweetness and more traditional Japanese teriyaki style, less gloppy and sugary."},{"number":9,"name":"Yoshino Teriyaki","youtubeLink":"https://www.youtube.com/watch?v=eNjv3A_pd2M","coords":"47.60911900388409, -122.32595392511142","googleMapsLink":"https://maps.app.goo.gl/XEUrDdPk4HAYzutx5","summary":"The chicken at Yoshino Teriyaki is somewhat messily chopped and mixed with sauce, showing decent char but is not particularly juicy or flavorful, described as run-of-the-mill.\r\nThe rice boasts good quality, with nice separate grains and is appealingly soaked with the savory sauce, enhancing its taste.\r\nThe cabbage salad is a highlight, offering a taste almost between a slaw and a sauerkraut, appreciated for its vinegary and slightly sweet flavor. It's recommended to be enjoyed in combination with the chicken and rice.\r\nDumplings are standard boiled frozen dumplings, suggesting they could be skipped in favor of other menu items like the spicy chicken or the notable cabbage salad for a better dining experience."}]